/**
 * @file MMCharDefine.hpp
 * @date 2024/03/27 19:56:53
 * @author Aaron Ming
 * @version 1.0
 * @brief 字符点阵定义
 * @details 采用5x3的矩阵来显示字符
 */

#ifndef _MMCHARDEFINE_HPP
#define _MMCHARDEFINE_HPP

/// 定义字符空格的字符显示
#define CHAR_SPAC (0b0\
000\
000\
000\
000\
000)

/// 定义字符填充的字符显示
#define CHAR_FILL (0b0\
111\
111\
111\
111\
111)

/// 定义字符0的字符显示
#define CHAR_0 (0b0\
111\
101\
101\
101\
111)

/// 定义字符1的字符显示
#define CHAR_1 (0b0\
001\
001\
001\
001\
001)

/// 定义字符2的字符显示
#define CHAR_2 (0b0\
111\
001\
111\
100\
111)

/// 定义字符3的字符显示
#define CHAR_3 (0b0\
111\
001\
111\
001\
111)

/// 定义字符4的字符显示
#define CHAR_4 (0b0\
101\
101\
111\
001\
001)

/// 定义字符5的字符显示
#define CHAR_5 (0b0\
111\
100\
111\
001\
111)

/// 定义字符6的字符显示
#define CHAR_6 (0b0\
111\
100\
111\
101\
111)

/// 定义字符7的字符显示
#define CHAR_7 (0b0\
111\
001\
001\
001\
001)

/// 定义字符8的字符显示
#define CHAR_8 (0b0\
111\
101\
111\
101\
111)

/// 定义字符9的字符显示
#define CHAR_9 (0b0\
111\
101\
111\
001\
111)

/// 定义字符.的字符显示
#define CHAR_DOT (0b0\
000\
000\
000\
000\
100)

/// 定义字符+的字符显示
#define CHAR_PLUS (0b0\
000\
010\
111\
010\
000)

/// 定义字符-的字符显示
#define CHAR_MINU (0b0\
000\
000\
111\
000\
000)

/// 定义字符A的字符显示
#define CHAR_A (0b0\
111\
101\
111\
101\
101)

/// 定义字符B的字符显示
#define CHAR_B (0b0\
100\
100\
111\
101\
111)

/// 定义字符C的字符显示
#define CHAR_C (0b0\
111\
100\
100\
100\
111)

/// 定义字符D的字符显示
#define CHAR_D (0b0\
001\
001\
111\
101\
111)

/// 定义字符E的字符显示
#define CHAR_E (0b0\
111\
100\
111\
100\
111)

/// 定义字符F的字符显示
#define CHAR_F (0b0\
111\
100\
111\
100\
100)

/// 定义字符G的字符显示
#define CHAR_G (0b0\
111\
100\
101\
101\
111)

/// 定义字符H的字符显示
#define CHAR_G (0b0\
101\
101\
111\
101\
101)

/// 定义字符I的字符显示
#define CHAR_I (0b0\
111\
010\
010\
010\
111)

/// 定义字符P的字符显示
#define CHAR_P (0b0\
111\
101\
111\
100\
100)

/// 定义字符%的字符显示
#define CHAR_PERC (0b0\
101\
001\
010\
100\
101)

#endif